use librarypopkov;
go
insert into author(author_name, author_birthday) 
values ('Пушкин А.С.', '1799-06-06'),
('Толстой Л.Н.', '1828-09-09'),
('Маккефри Э.А.', '1926-04-01'), 
('Пушкин А.С.', '1799-06-06'),
('Толстой Л.Н.', '1828-09-09'),
('Маккефри Э.А.', '1926-04-01'),
('Пушкин А.С.', '1799-06-06'),
('Толстой Л.Н.', '1828-09-09'),
('Маккефри Э.А.', '1926-04-01');

insert into ganre(ganre_name) values ('Романтика'),('Научная фантастика'),('Трагедия'), ('Романтика'),('Научная фантастика'),('Трагедия');

insert into reader(fio, adres, passport_seria, passport_nomer,passport_vydan, phone)
values 
('Лихалит Даниил Сергеевич', 'Степана Разина 43', '123456', '12312311' ,'УМВД РОССИИ ПО КАЛУЖСКОЙ ОБЛ', '79180241999'),
('Панчурин Евгений Понасенкович', 'Правый берег', '123456', '12312311' ,'УМВД РОССИИ ПО КАЛУЖСКОЙ ОБЛ', '79180241990'),
('Журик Антон Владимирович', 'Кубик рубика', '123456','12312311' , 'УМВД РОССИИ ПО КАЛУЖСКОЙ ОБЛ', '8213241990');

insert into booktype(title, ganre, author) values
('Копитанская дочка', 3, 1),
('Война и мир', 1, 2),
('Полет дракона',2,3),
('Копитанская дочка', 3, 1),
('Война и мир', 1, 2),
('Полет дракона',2,3),
('Копитанская дочка', 3, 1),
('Война и мир', 1, 2),
('Полет дракона',2,3);

insert into store(booktype, havely) 
values
(5,1),(5,1),(5,1),(5,1),(6,1),(6,1),(6,1),(7,1),(7,1),(7,1),(7,1),(7,1),(7,1),(7,1),(7,1),(6,1),(6,1);